// Лаб 1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;
#include <windows.h>;

int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    //програма 1
    std::cout << "HELLO!!!";

    cout << endl << endl << endl;


    // програма 2
    cout << "  ---------------- " << endl;
    cout << " |                |" << endl;
    cout << " |                |" << endl;
    cout << " |                |" << endl;
    cout << " |                |" << endl;
    cout << " |                |" << endl;
    cout << " |                |" << endl;
    cout << " |                |" << endl;
    cout << "  ---------------- " << endl;

    cout << endl << endl << endl;

    // програма 3

    cout << "          Прізвище : Саранча " << endl;
    cout << "              Ім'я : Валерія " << endl;
    cout << "       По батькові : Олегівна " << endl;
    cout << "             Стать : жіноча " << endl;
    cout << "   Дата народження : 2004-02-17 " << endl;
    cout << "            Адреса : м. Марганець, Дніпропетровська область, Україна " << endl;
    cout << "    Номер телефону : +380664311293 " << endl;
    cout << "    Місце навчання : ФПМ, ДНУ ім. Олеся Гончара " << endl;
    cout << "             Група : ПА-23-1 " << endl;
    cout << "             Хоббі : волейбол " << endl;
    system("pause");




}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
